app/controllers/profile_controller.rb

SELECT "students".* FROM "students" ORDER BY lastName
---
  def index
     @students = Student.all