app/controllers/researches_controller.rb

  def show
    @research = Research.find(params[:id])
---
SELECT "researches".* FROM "researches" WHERE "researches"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @research = Research.find(params[:id])
---
SELECT "researches".* FROM "researches" WHERE "researches"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @advisor = Advisor.find(params[:advisor_id])
    @research = @advisor.researches.create!(params[:research])
---
INSERT INTO "researches" ("academic_level", "academic_unit", "application_deadline", "class_required", "contact_info", "created_at", "description", "gpa", "paid", "requirements", "student_research_assistant", "title", "unmjobs_name", "unmjobs_number", "updated_at", "work_period") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @research = Research.find(params[:id])
    @research.destroy
---
SELECT "researches".* FROM "researches" WHERE "researches"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "researches" WHERE "researches"."id" = ?  [["id", 1]]